/* 
  Localizable.strings
  dialog

  Created by Bart Reardon on 29/5/2022.
  
  Danish translation by Anders Damgaard Jensen
*/

// error sheet
"invalid-input" = "Et eller flere input felter er forkerte";
"is-required" = "Påkrævet";
"no-pattern" = "ikke svarer til det krævede format";

// required fields text
"required-note" = "* Påkrævet felt";

//buttons
"button-cancel" = "Annuller";
"button-more-info" = "Mere Information";
"button-ok" = "OK";
"button-select" = "Vælg";

//default text
"default-title" = "En vigtig besked";
"default-message" = "Dette er en vigtigt besked\n\nLæs venligst";
"help-hover" = "Klik for yderligere information";

//constructor kit labels
"ck-welcome"            = "Velkommen til swiftDialog Builder";
"ck-welcomeinfo"        = "Vælg egenskaber til venstre for at ændre. swiftDialog vil opdatere for at vise ændringerne i realtid";
"ck-basic"              = "Grundlæggende";
"ck-content"            = "Indhold";
"ck-window"             = "Vindue";
"ck-sidebar"            = "Sidebjælke";
"ck-dataentry"          = "Indtastning af data";
"ck-buttons"            = "Knapper";
"ck-advanced"           = "Fremskreden";
"ck-listitems"          = "Listeelementer";
"ck-images"             = "Billeder";
"ck-media"              = "Medier";
"ck-output"             = "Produktion";
"ck-jsonoutput"         = "JSON Output";
"ck-quit"               = "Afslut";
"ck-exportcommand"      = "Eksportkommando";
"ck-title"              = "Titel";
"ck-colour"             = "Farve";
"ck-reset"              = "Nulstil";
"ck-fontsize"           = "Skriftstørrelse: ";
"ck-value"              = "værdi:";
"ck-message"            = "Besked";
"ck-textalignmnet"      = "Tekstjustering";
"ck-verticalposition"   = "Lodret position";
"ck-windowheight"       = "Vindue Højde";
"ck-heightvalue"        = "Højdeværdi:";
"ck-windowwidth"        = "Vinduebredde";
"ck-widthvalue"         = "Breddeværdi:";
"ck-windowproperties"   = "Vindueegenskaber";
"ck-presetsizes"        = "Forudindstillede størrelser";
"ck-small"              = "Lille";
"ck-big"                = "Stor";
"ck-screenblur"         = "Skærmbaggrundssløring";
"ck-movable"            = "Bevægelig";
"ck-forceontop"         = "Kraft på toppen";
"ck-progressbar"        = "Progress Bar";
"ck-progressvalue"      = "Progress værdi:";
"ck-progresstext"       = "Forløbstekst:";
"ck-bannerimage"        = "Bannerbillede";
"ck-select"             = "Vælg";
"ck-watermark"          = "Vandmærke";
"ck-fill"               = "Fylde";
"ck-alpha"              = "Alfa";
"ck-scale"              = "Vægt";
"ck-position"           = "Position";
"ck-icon"               = "Ikon";
"ck-visible"            = "Synlig";
"ck-centred"            = "Centreret";
"ck-select"             = "Vælg";
"ck-iconsize"           = "Ikonstørrelse";
"ck-sizevalue"          = "Størrelsesværdi:";
"ck-overlay"            = "Overlejring";
"ck-infobox"            = "Infoboks";
"ck-infotext"           = "Infotekst";
"ck-infotextlabel"      = "Infotekst";
"ck-button1"            = "Knap 1";
"ck-button2"            = "Knap 2";
"ck-infobuttonlabel"    = "Info-knap";
"ck-quitoninfo"         = "Afslut ved info";
"ck-label"              = "Etiket: ";
"ck-infobuttonaction"   = "Infoknaphandling: ";
"ck-autoplay"           = "Automatisk afspilning";
"ck-autoplayseconds"    = "Autoplay sekunder";
"ck-path"               = "Sti";
"ck-caption"            = "Billedtekst";
"ck-statustext"         = "Statustekst";
"ck-status"             = "Status";
"ck-formatjson"         = "Formater output som JSON";
"ck-textfields"         = "Tekstfelter";
"ck-show"               = "At vise";
"ck-required"           = "Påkrævet";
"ck-secure"             = "Sikker";
"ck-prompt"             = "Hurtig";
"ck-regex"              = "Regex";
"ck-regexerror"         = "Regex-fejl";
"ck-select"             = "Vælg";
"ck-checkbox"           = "Afkrydsningsfelt";
"ck-video"              = "Video";
"ck-filename"           = "Filnavn";
"ck-web"                = "Web";
"ck-url"                = "URL";
"ck-disabled"           = "handicappet";
"ck-enabled"            = "Aktiveret";
